{
    "structured_data": {
        "contact": {
            "name": "Philippe Nault",
            "email": "p_nault@hotmail.com",
            "phone": "(902)430-2630",
            "location": "Halifax, NS",
            "linkedin": "www.linkedin.com/in/phil-nault-99a7542aa"
        },
        "professional_summary": "Cybersecurity professional with experience in penetration testing, vulnerability assessment and risk management. Strong military background provides a unique perspective on layered defense and how to get around them. Proven track record in leading technical projects, troubleshooting complex issues, and communicating technical issues.",
        "education": [
            {
                "degree": "Cyber Security Diploma",
                "institution": "Nova Scotia Community College",
                "graduation_year": "2025"
            },
            {
                "degree": "B.Eng.",
                "field_of_study": "Chemical & Materials Engineering",
                "institution": "Royal Military College of Canada",
                "graduation_year": "2001"
            }
        ],
        "experience": [
            {
                "job_title": "Head of Offensive Security Club",
                "company": "Nova Scotia Community College",
                "start_date": "August 2024",
                "end_date": "Present",
                "responsibilities": "Volunteer position where I created CTFs and labs using Virtual Machines to help my fellow Cyber Security students hone their Offensive Security skills"
            },
            {
                "job_title": "Senior Staff Officer – Simulation and Modelling",
                "company": "Maritime Warfare Center",
                "start_date": "July 2022",
                "end_date": "August 2023",
                "responsibilities": "Responsible for Simulation & Modelling for the Royal Canadian Navy (RCN). Managed the upgrade project of a classified network worth $40 million, resulting in net progress towards modernizing the RCN."
            },
            {
                "job_title": "Combat Systems Engineering Division Commander",
                "company": "Naval Fleet School (Atlantic)",
                "start_date": "July 2019",
                "end_date": "July 2022",
                "responsibilities": "Provided oversight for the trades training of all Weapons Engineering Technician and Combat Systems Engineering Officers of the East Coast fleet. Provided mentoring, supervision and coaching of 40 staff, leading to a successful throughput of approximately 120 students per year."
            },
            {
                "job_title": "Executive Officer",
                "company": "Fleet Maintenance Facility Cape Scott",
                "start_date": "October 2016",
                "end_date": "July 2019",
                "responsibilities": "Responsible for military HR, IT, and security of a 1000 person unit focused on ship repair and maintenance. Managed a team of 7 personnel (military and civilian), ensuring that operational risks were managed adequately and maintenance of the ships proceeded smoothly."
            },
            {
                "job_title": "Campus Support Division Commander",
                "company": "Naval Fleet School (Atlantic)",
                "start_date": "January 2014",
                "end_date": "October 2016",
                "responsibilities": "Responsible for the Security, IT, Scheduling, Purchasing, Safety & Environment, and Equipment Maintenance of the school. Supervised 8 section heads and managed 60 personnel to ensure that training was continuous for approximately 600 students per year going through trades training. Risk managed any potential disruption to training to keep down-time to a minimum."
            },
            {
                "job_title": "Combat Systems Engineering Officer",
                "company": "HMCS Ville de Quebec",
                "start_date": "July 2012",
                "end_date": "January 2014",
                "responsibilities": "Responsible for the maintenance and mission readiness of all Combat Systems aboard HMCS Ville de Quebec. Managed a department of 60 technicians to ensure that all required systems were maintained and managed risk to minimize equipment down-time, resulting in a successful counter-drug patrol in the Caribbean Basin."
            },
            {
                "job_title": "Staff Officer (Minor Warships and Auxiliary Vessels)",
                "company": "Maritime Equipment Program Management",
                "start_date": "July 2010",
                "end_date": "July 2012",
                "responsibilities": "Responsible for equipment upgrade projects and maintenance pertaining to Minor War Vessels of the RCN. Managed multi-million dollar upgrade projects, resulting in a satellite communication upgrade for the KINGSTON class Maritime Coastal Defense Vessels."
            },
            {
                "job_title": "Engineering Officer under training",
                "company": "Royal Canadian Navy",
                "start_date": "August 2004",
                "end_date": "July 2010",
                "responsibilities": "Trained to act as Head of Combat Systems Engineering Department aboard HALIFAX class Frigates, Unit Radiation Safety Officer, Unit General Safety Officer, Unit Demolitions Officer, Unit Ammunition Officer and Unit Laser Safety Officer. Accumulated 300 sea days deploying to the Gulf of Aden and the Arctic Ocean."
            }
        ],
        "skills": [
            "Kali Linux",
            "Nmap",
            "Metasploit",
            "BurpSuite",
            "Gobuster",
            "Nikto",
            "CrackMapExec",
            "Impacket suite",
            "Nessus",
            "Bloodhound",
            "Hydra",
            "Hashcat",
            "John the Ripper",
            "Python",
            "Bash Scripting",
            "JavaScript",
            "SQL",
            "Vulnerability Scanning",
            "Vulnerability Exploitation",
            "Privilege Escalation",
            "Web application exploitation",
            "Client-side attacks",
            "Network pivoting",
            "Active Directory exploitation"
        ],
        "certifications": [
            {
                "name": "OffSec Certified Professional (OSCP)"
            }
        ],
        "languages": [
            "French",
            "English"
        ]
    },
    "years_exp": "22+ years of experience in Engineering, Cybersecurity, and Project Management",
    "profile": "Philippe Nault is a seasoned cybersecurity professional with a robust background in penetration testing, vulnerability assessment, and risk management. With a unique perspective shaped by his extensive military career, he excels at understanding layered defense systems and identifying vulnerabilities. Philippe is committed to fostering skill development, demonstrated by his leadership role as Head of Offensive Security Club at Nova Scotia Community College, where he designs Capture-the-Flag challenges and labs to sharpen students’ offensive security abilities. He is set to graduate with a Cyber Security Diploma from NSCC in 2025, complementing his Bachelor’s degree in Chemical & Materials Engineering from the Royal Military College of Canada.\n\nOver two decades, Philippe has held high-impact roles within the Royal Canadian Navy and associated organizations, consistently delivering results in complex, technical environments. Notably, he managed a $40 million classified network upgrade project at the Maritime Warfare Center, modernizing critical infrastructure. His leadership as Combat Systems Engineering Division Commander at Naval Fleet School ensured the training and mentorship of over 120 students annually. Philippe’s expertise extends beyond military operations; he has successfully led multi-million dollar equipment upgrade projects, such as enhancing satellite communications for defense vessels, showcasing his ability to manage large-scale initiatives with precision and accountability.\n\nEquipped with advanced technical skills, Philippe is proficient in tools like Kali Linux, Metasploit, Nessus, and Bloodhound, alongside programming languages such as Python, Bash scripting, and SQL. He holds the esteemed OffSec Certified Professional (OSCP) credential, affirming his capability in vulnerability exploitation, privilege escalation, and Active Directory exploitation. Bilingual in French and English, Philippe combines technical excellence with strong communication skills, making him an invaluable asset to any team aiming to fortify its cybersecurity framework or lead cutting-edge offensive security initiatives.",
    "res_dict": {
        "experience": {
            "cgi_experience": [],
            "other_experience": [
                {
                    "company": "Nova Scotia Community College",
                    "position_title": "Head of Offensive Security Club",
                    "start_date": "08/24",
                    "end_date": "Present",
                    "responsibilities": [
                        "Created capture-the-flag challenges and labs using virtual machines to enhance offensive security skills of students."
                    ],
                    "technologies": [
                        "Virtual Machines",
                        "CTFs"
                    ]
                },
                {
                    "company": "Maritime Warfare Center",
                    "position_title": "Senior Staff Officer – Simulation and Modelling",
                    "start_date": "07/22",
                    "end_date": "08/23",
                    "responsibilities": [
                        "Directed simulation and modeling operations for the Royal Canadian Navy, ensuring accurate and effective mission planning.",
                        "Oversaw a $40 million classified network upgrade project to modernize military operational capabilities."
                    ],
                    "technologies": [
                        "Classified Network Systems"
                    ]
                },
                {
                    "company": "Naval Fleet School (Atlantic)",
                    "position_title": "Combat Systems Engineering Division Commander",
                    "start_date": "07/19",
                    "end_date": "07/22",
                    "responsibilities": [
                        "Supervised the training of Weapons Engineering Technicians and Combat Systems Engineering Officers for East Coast fleet.",
                        "Mentored, supervised, and coached 40 staff, ensuring high standards and professional growth.",
                        "Achieved a throughput of approximately 120 students annually through effective oversight of training programs."
                    ],
                    "technologies": [
                        "Training Systems"
                    ]
                },
                {
                    "company": "Fleet Maintenance Facility Cape Scott",
                    "position_title": "Executive Officer",
                    "start_date": "10/16",
                    "end_date": "07/19",
                    "responsibilities": [
                        "Managed human resources, IT, and security for a 1000-person ship repair and maintenance unit.",
                        "Led a team of 7 personnel, ensuring smooth operations and effective team collaboration.",
                        "Mitigated operational risks to ensure uninterrupted maintenance and repair of naval ships."
                    ],
                    "technologies": [
                        "HR Systems",
                        "IT Systems",
                        "Security Systems"
                    ]
                },
                {
                    "company": "Naval Fleet School (Atlantic)",
                    "position_title": "Campus Support Division Commander",
                    "start_date": "01/14",
                    "end_date": "10/16",
                    "responsibilities": [
                        "Oversaw security, IT, scheduling, purchasing, safety, and equipment maintenance for the training school.",
                        "Supervised 8 section heads and managed a team of 60 personnel to ensure operational efficiency.",
                        "Ensured the training of approximately 600 students annually, minimizing disruptions and downtime.",
                        "Effectively risk-managed potential issues to maintain the smooth flow of training schedules."
                    ],
                    "technologies": [
                        "Security Systems",
                        "IT Systems",
                        "Scheduling Tools"
                    ]
                },
                {
                    "company": "HMCS Ville de Quebec",
                    "position_title": "Combat Systems Engineering Officer",
                    "start_date": "07/12",
                    "end_date": "01/14",
                    "responsibilities": [
                        "Directed the maintenance and mission readiness of all combat systems aboard the naval vessel HMCS Ville de Quebec.",
                        "Led a department of 60 technicians, ensuring operational readiness and minimal equipment downtime.",
                        "Contributed to a successful counter-drug patrol mission in the Caribbean Basin by ensuring system reliability."
                    ],
                    "technologies": [
                        "Combat Systems",
                        "Caribbean Basin Navigation"
                    ]
                },
                {
                    "company": "Maritime Equipment Program Management",
                    "position_title": "Staff Officer (Minor Warships and Auxiliary Vessels)",
                    "start_date": "07/10",
                    "end_date": "07/12",
                    "responsibilities": [
                        "Managed equipment upgrade projects and maintenance for minor war vessels of the Royal Canadian Navy.",
                        "Oversaw multi-million dollar upgrade projects, ensuring timely and efficient execution.",
                        "Delivered a satellite communication upgrade for KINGSTON class Maritime Coastal Defense Vessels."
                    ],
                    "technologies": [
                        "Satellite Communication Systems"
                    ]
                },
                {
                    "company": "Royal Canadian Navy",
                    "position_title": "Engineering Officer under training",
                    "start_date": "08/04",
                    "end_date": "07/10",
                    "responsibilities": [
                        "Completed training as Head of Combat Systems Engineering for HALIFAX class frigates, ensuring readiness.",
                        "Served as Unit Radiation Safety Officer, General Safety Officer, Demolitions Officer, and Ammunition Officer.",
                        "Accumulated 300 sea days, with deployments to the Gulf of Aden and Arctic Ocean, ensuring mission success."
                    ],
                    "technologies": [
                        "HALIFAX class Frigates",
                        "Safety Systems"
                    ]
                }
            ]
        },
        "volunteer": {
            "volunteer_experience": [
                {
                    "role": "Head of Offensive Security Club",
                    "organization": "Nova Scotia Community College",
                    "location": "Nova Scotia, Canada",
                    "start_date": "08/24",
                    "end_date": "Present",
                    "responsibilities": [
                        "Created Capture The Flag (CTF) challenges and virtual labs.",
                        "Facilitated skill development in offensive security among Cyber Security students.",
                        "Utilized virtual machines for hands-on learning experiences."
                    ]
                }
            ]
        },
        "other_sections": {
            "industry_experience": [
                "Cybersecurity",
                "Military",
                "Naval Engineering",
                "Ship Maintenance",
                "Defense Technology"
            ],
            "technical_specializations": [
                "Penetration Testing",
                "Vulnerability Assessment",
                "Risk Management",
                "Simulation and Modelling",
                "Combat Systems Engineering"
            ],
            "areas_of_expertise": [
                "Vulnerability Scanning",
                "Vulnerability Exploitation",
                "Privilege Escalation",
                "Web Application Exploitation",
                "Client-side Attacks",
                "Network Pivoting",
                "Active Directory Exploitation",
                "Technical Project Leadership",
                "Troubleshooting Complex Issues"
            ],
            "languages": [
                "English",
                "French"
            ],
            "environments": [
                "Royal Canadian Navy Vessels",
                "Naval Fleet School",
                "Fleet Maintenance Facility",
                "Classified Networks",
                "Offensive Security Virtual Labs"
            ],
            "tools_and_software": [
                "Kali Linux",
                "Nmap",
                "Metasploit",
                "BurpSuite",
                "Gobuster",
                "Nikto",
                "CrackMapExec",
                "Impacket Suite",
                "Nessus",
                "Bloodhound",
                "Hydra",
                "Hashcat",
                "John the Ripper"
            ]
        },
        "skills_summary": {
            "technical_skills": [
                {
                    "skill": "Python",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Bash Scripting",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "SQL",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Network pivoting",
                    "years_of_experience": 1,
                    "skill_level": 2
                },
                {
                    "skill": "Active Directory exploitation",
                    "years_of_experience": 1,
                    "skill_level": 2
                }
            ],
            "application_knowledge": [
                {
                    "skill": "Kali Linux",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Nmap",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Metasploit",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "BurpSuite",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Nessus",
                    "years_of_experience": 2,
                    "skill_level": 3
                }
            ],
            "it_disciplines": [
                {
                    "skill": "Penetration Testing",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Vulnerability Assessment",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Risk Management",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "IT Security",
                    "years_of_experience": 4,
                    "skill_level": 4
                }
            ],
            "industry_knowledge": [
                {
                    "skill": "Military Cybersecurity Operations",
                    "years_of_experience": 10,
                    "skill_level": 4
                },
                {
                    "skill": "Naval Systems Engineering",
                    "years_of_experience": 10,
                    "skill_level": 4
                },
                {
                    "skill": "Ship Repair and Maintenance",
                    "years_of_experience": 7,
                    "skill_level": 4
                }
            ],
            "other_relevant_skills": [
                {
                    "skill": "Fluency in French and English",
                    "years_of_experience": 20,
                    "skill_level": 4
                },
                {
                    "skill": "Team Leadership",
                    "years_of_experience": 8,
                    "skill_level": 4
                },
                {
                    "skill": "Project Management",
                    "years_of_experience": 7,
                    "skill_level": 4
                },
                {
                    "skill": "Training and Mentoring",
                    "years_of_experience": 10,
                    "skill_level": 4
                },
                {
                    "skill": "CTF/Virtual Lab Creation",
                    "years_of_experience": 1,
                    "skill_level": 2
                }
            ]
        }
    },
    "job_description": "None provided"
}