{
    "structured_data": {
        "contact": {
            "name": "Veronica Hawkes",
            "email": "vhawkes@dal.ca",
            "phone": "902-324-1548",
            "location": "Hilden, NS",
            "linkedin": "linkedin.com/in/veronicahawkes"
        },
        "professional_summary": "A highly driven and focused individual with more than 10,000 engagements over 9 years working in client-facing roles. Strong analytical and problem-solving capabilities developed through university-level courses, research, and retail experience. Excellent leadership, communication, and interpersonal skills developed through supporting client projects within CGI and the Government of Nova Scotia and leading teams in both competitive sport and retail environments. Exceptional team player with financial and technical knowledge who can adapt and function in fast-paced environments.",
        "education": [
            {
                "degree": "Master of Business Administration",
                "field_of_study": "Enterprise Analytics",
                "institution": "Dalhousie University",
                "location": "Halifax, NS",
                "graduation_year": "2024"
            },
            {
                "degree": "Bachelor of Science in Human Kinetics",
                "field_of_study": "Human Kinetics",
                "institution": "St. Francis Xavier University",
                "location": "Antigonish, NS",
                "graduation_year": "2022"
            }
        ],
        "experience": [
            {
                "job_title": "Business Analyst & Project Coordinator",
                "company": "CGI",
                "location": "Halifax, NS",
                "start_date": "Jul. 2024",
                "end_date": "Present",
                "responsibilities": "Documented current state business processes to define operational efficiency opportunities. Utilized advanced analytical skills to derive actionable insights, enhancing data-driven decision-making accuracy for project analysis. Drafted future-state recommendations including streamlined processes, customer journey maps, organizational design, and operational improvements. Produced comprehensive reports using Excel and PowerPoint, improving stakeholder communication and aiding decision-making processes. Created future state blueprints and implementation plans with organizational structure, roles, effort, and cost for implementation. Coordinated tasks, schedules, and resources, ensuring project success within defined scopes."
            },
            {
                "job_title": "Cash Balancer",
                "company": "Canadian Tire",
                "location": "Truro, NS",
                "start_date": "Nov. 2023",
                "end_date": "Jul. 2024",
                "responsibilities": "Ensured financial documents obtained accurate cash flow information from the establishment. Leveraged knowledge gained from finance and financial statement courses to understand and interpret documents. Responsible for allocating all funds paid to the establishment to develop a bank deposit."
            },
            {
                "job_title": "Operational & Service Excellence Intern",
                "company": "Government of Nova Scotia",
                "location": "Halifax, NS",
                "start_date": "Jan. 2023",
                "end_date": "Aug. 2023",
                "responsibilities": "Produced programs, services, and trainings virtually for more than 230 participants across the Provincial Government leveraging MS Teams, Power Automate, Excel, and Outlook. Facilitated and led team meetings using periodic management to identify organizational barriers. Created standard operating procedures for services and events to ensure uniform operations. Acquired comprehensive understanding of business process improvement by overseeing proper functioning of the Foundations of Business Process Improvement Training, the Lean Six Sigma Green Belt Program, the Business Process Owner Training, and the Lean Six Sigma Kaizen Belt Training. Utilized Power BI to improve data analytics within the team by creating visual dashboards. Supported individuals across Government achieve their Lean Six Sigma Yellow Belt Certification by completing Quick Wins in their business areas. Collaborated with several colleagues to plan and coordinate a major event for more than 70 people. Developed an organizational system using 5S methodology, a Lean Six Sigma approach improving overall team efficiency."
            },
            {
                "job_title": "Customer Service Representative",
                "company": "Canadian Tire",
                "location": "Truro, NS",
                "start_date": "Nov. 2015",
                "end_date": "Jun. 2022",
                "responsibilities": "Exceptional communication, conflict resolution, and organizational skills developed through triaging customer inquiries and complaints. Provided exceptional customer service to diverse customer needs in a fast-paced environment. Demonstrated responsibility and reliability handling cash and preparing registers for store open. Trained incoming employees on store policies, processes, and store-specific technology. Organized staffing allocation by determining break times for up to 8 cashiers per shift; managing time to ensure associates' needs were met. Developed extensive problem-solving, organizational, and communication skills working in various departments."
            }
        ],
        "skills": [
            "Tableau",
            "SAP",
            "MS Teams",
            "Power Automate",
            "Excel"
        ],
        "certifications": [
            {
                "name": "Lean Six Sigma Green Belt",
                "issuing_organization": "Six Sigma Global Institute",
                "issue_date": "Dec. 2024"
            },
            {
                "name": "Certified SAFe 6 Practitioner",
                "issuing_organization": "Scaled Agile Inc.",
                "issue_date": "Aug. 2024"
            },
            {
                "name": "SAP Student Recognition Award",
                "issuing_organization": "SAP University Alliances, Dalhousie University",
                "issue_date": "Jun. 2024"
            },
            {
                "name": "Lean Six Sigma Yellow Belt",
                "issuing_organization": "Government of Nova Scotia",
                "issue_date": "Jan. 2023"
            }
        ]
    },
    "years_exp": "10 years of experience in Business Analysis and Project Coordination",
    "profile": "Veronica Hawkes is a dynamic business professional with over nine years of experience in client-facing roles, known for her exceptional leadership, analytical acumen, and adaptability in fast-paced environments. She brings a unique blend of financial expertise, technical proficiency, and interpersonal skills, honed through her work with organizations such as CGI, the Government of Nova Scotia, and Canadian Tire. Veronica is currently advancing her impact as a Business Analyst and Project Coordinator at CGI, where she develops future-state business blueprints, streamlines operational processes, and drives data-informed decision-making through comprehensive reporting and analysis.\n\nVeronica's academic foundation is equally impressive, holding a Bachelor of Science in Human Kinetics from St. Francis Xavier University and a Master of Business Administration in Enterprise Analytics from Dalhousie University, which she will complete by 2024. She is certified in Lean Six Sigma Green Belt and SAFe 6 Practitioner, showcasing her commitment to continuous professional development. Her technical toolkit includes expertise in Tableau, SAP, Power Automate, and Power BI, which she has adeptly utilized to improve operational efficiency and data visualization in roles such as her internship with the Government of Nova Scotia, where she supported over 230 participants and enhanced team productivity through innovative solutions.\n\nThroughout her career, Veronica has consistently demonstrated her ability to lead and drive results. Whether coordinating major events, training new employees, or implementing Lean Six Sigma methodologies to optimize workflows, she is a proven problem solver and team player. With her strong foundation in analytics, operational excellence, and client service, Veronica is well-positioned to deliver impactful solutions and contribute to organizational success.",
    "res_dict": {
        "experience": {
            "cgi_experience": [
                {
                    "cgi_client_or_sector": null,
                    "cgi_position_title": "Business Analyst & Project Coordinator",
                    "cgi_start_date": "07/24",
                    "cgi_end_date": "Present",
                    "cgi_responsibilities": [
                        "Documented and analyzed current state business processes to identify and define operational efficiency opportunities.",
                        "Applied advanced analytical skills to derive actionable insights, improving data-driven decision-making for project analysis.",
                        "Drafted detailed future-state recommendations including streamlined processes, customer journey maps, and organizational design.",
                        "Created implementation plans with future state blueprints, organizational structure, roles, effort estimation, and cost analysis.",
                        "Developed comprehensive reports using Excel and PowerPoint to enhance stakeholder communication and aid decision-making.",
                        "Coordinated tasks, schedules, and resources, ensuring successful project delivery within defined scopes."
                    ],
                    "cgi_technologies": [
                        "Excel",
                        "PowerPoint"
                    ]
                }
            ],
            "other_experience": [
                {
                    "company": "Canadian Tire",
                    "position_title": "Cash Balancer",
                    "start_date": "11/23",
                    "end_date": "07/24",
                    "responsibilities": [
                        "Maintained accurate financial records by gathering and verifying cash flow information from financial documents.",
                        "Utilized finance knowledge from coursework to understand and interpret financial documents for accuracy and reporting.",
                        "Allocated funds paid to the establishment to prepare accurate bank deposits, ensuring financial compliance."
                    ],
                    "technologies": []
                },
                {
                    "company": "Government of Nova Scotia",
                    "position_title": "Operational & Service Excellence Intern",
                    "start_date": "01/23",
                    "end_date": "08/23",
                    "responsibilities": [
                        "Produced virtual programs, services, and training sessions for over 230 participants across the Provincial Government.",
                        "Facilitated and led team meetings using periodic management techniques to identify and address organizational barriers.",
                        "Developed standard operating procedures to ensure consistent operations for services and events.",
                        "Managed business process improvement programs, including Lean Six Sigma training and certifications for government staff.",
                        "Created Power BI dashboards to visualize data analytics and support informed decision-making within the team.",
                        "Collaborated with colleagues to plan and coordinate major events, including a 70-person gathering.",
                        "Implemented the 5S methodology to develop organizational systems that improved team efficiency and productivity."
                    ],
                    "technologies": [
                        "MS Teams",
                        "Power Automate",
                        "Excel",
                        "Outlook",
                        "Power BI"
                    ]
                },
                {
                    "company": "Canadian Tire",
                    "position_title": "Customer Service Representative",
                    "start_date": "11/15",
                    "end_date": "06/22",
                    "responsibilities": [
                        "Responded to customer inquiries and complaints, developing exceptional communication and conflict resolution skills.",
                        "Delivered personalized customer service for diverse needs in a high-paced retail setting.",
                        "Handled cash transactions responsibly and prepared registers for store opening, ensuring operational readiness.",
                        "Trained new employees on store policies, processes, and technology to facilitate smooth onboarding.",
                        "Organized staffing allocation by managing break schedules for up to 8 cashiers, ensuring efficiency and morale.",
                        "Worked across various departments, honing problem-solving, organizational, and communication skills."
                    ],
                    "technologies": []
                }
            ]
        },
        "volunteer": {
            "volunteer_experience": []
        },
        "other_sections": {
            "industry_experience": [
                "Information Technology (CGI)",
                "Retail (Canadian Tire)",
                "Government (Government of Nova Scotia)"
            ],
            "technical_specializations": [
                "Business process improvement",
                "Data analytics",
                "Lean Six Sigma methodologies",
                "Periodic management"
            ],
            "areas_of_expertise": [
                "Leadership",
                "Analytical problem-solving",
                "Interpersonal communication",
                "Customer service",
                "Operational excellence",
                "Team coordination"
            ],
            "languages": [
                "English"
            ],
            "environments": [
                "Client-facing roles",
                "Fast-paced environments",
                "Virtual program facilitation"
            ],
            "tools_and_software": [
                "Tableau",
                "SAP",
                "MS Teams",
                "Power Automate",
                "Excel",
                "Power BI",
                "Outlook"
            ]
        },
        "skills_summary": {
            "technical_skills": [
                {
                    "skill": "Tableau",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Power BI",
                    "years_of_experience": 1,
                    "skill_level": 3
                },
                {
                    "skill": "Excel",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "Power Automate",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "MS Teams",
                    "years_of_experience": 2,
                    "skill_level": 3
                }
            ],
            "application_knowledge": [
                {
                    "skill": "SAP",
                    "years_of_experience": 1,
                    "skill_level": 2
                },
                {
                    "skill": "Customer Journey Mapping",
                    "years_of_experience": 1,
                    "skill_level": 3
                },
                {
                    "skill": "Business Process Improvement",
                    "years_of_experience": 1,
                    "skill_level": 3
                },
                {
                    "skill": "Data Analytics",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Organizational Design",
                    "years_of_experience": 1,
                    "skill_level": 3
                }
            ],
            "it_disciplines": [
                {
                    "skill": "Business Analysis",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Project Coordination",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Lean Six Sigma Methodologies",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Process Optimization",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Standard Operating Procedure Creation",
                    "years_of_experience": 2,
                    "skill_level": 3
                }
            ],
            "industry_knowledge": [
                {
                    "skill": "Government Operations",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Retail Management",
                    "years_of_experience": 7,
                    "skill_level": 4
                },
                {
                    "skill": "Operational Excellence",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Finance & Cash Handling",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Event Coordination",
                    "years_of_experience": 1,
                    "skill_level": 3
                }
            ],
            "other_relevant_skills": [
                {
                    "skill": "Leadership",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "Communication",
                    "years_of_experience": 5,
                    "skill_level": 4
                },
                {
                    "skill": "Problem-Solving",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "Team Collaboration",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "Training & Development",
                    "years_of_experience": 3,
                    "skill_level": 3
                }
            ]
        }
    },
    "job_description": "None provided"
}