{
    "structured_data": {
        "contact": {
            "name": "ANANYA APPARAJU",
            "email": "ananya.apparaju@gmail.com",
            "phone": "",
            "location": "",
            "linkedin": "",
            "website": ""
        },
        "professional_summary": "Passionate about solving complex problems in natural language processing and information retrieval. Skilled in machine learning and deep learning techniques. Experienced in Python, Java, and C++. Committed to continuous learning and driving innovation in language technology.",
        "education": [
            {
                "degree": "Master of Data Science",
                "field_of_study": "Computational Linguistics",
                "institution": "University of British Columbia",
                "location": "Vancouver, BC",
                "graduation_year": "06/2023"
            },
            {
                "degree": "Bachelor of Technology",
                "field_of_study": "Electronics and Communications Engineering",
                "institution": "Jawaharlal Nehru Technological University",
                "location": "Hyderabad, Telangana, India",
                "graduation_year": "11/2020"
            }
        ],
        "experience": [
            {
                "job_title": "Language Engineer I",
                "company": "Amazon",
                "location": "Chennai, India",
                "start_date": "11/25",
                "end_date": "Present",
                "responsibilities": "Collaborated with scientists and engineers to design APIs, evaluate LLM performance, and develop scalable solutions for language data production and analysis. Engineered prompts for generative AI, automated workflows, and performed data analysis using Python and scripting tools. Managed customer-facing ML and deterministic models, resolved production issues, deployed Alexa language updates, and tested new features with modeling tools."
            },
            {
                "job_title": "Machine Learning Engineer",
                "company": "TEKsystems at Meta",
                "location": "Vancouver, BC",
                "start_date": "02/2024",
                "end_date": "09/2024",
                "responsibilities": "Performed extensive feature replacement for ads-based models to ensure privacy compliance while retaining neutral metrics. Implemented innovative feature-replacement algorithms on models of varying architectures in a consolidated feature space. Conducted thorough testing and analysis through offline experimentation and online A/B testing. Collaborated closely with cross-functional teams to facilitate a seamless transition to privacy-compliant models."
            },
            {
                "job_title": "Prompt Engineering Team Lead",
                "company": "TEKsystems at Meta",
                "location": "Vancouver, BC",
                "start_date": "07/2023",
                "end_date": "02/2024",
                "responsibilities": "Led a comprehensive assessment of conversational abilities of generative AI models. Established a novel human evaluation process to measure specific conversational criteria- developed metrics for safety, accuracy, naturalness, and engagement levels of AI responses. Constructed effective prompt-based finetuning strategies, improved thorough adversarial and red-teaming experimentation. Developed a backend Pythonic system to augment human evaluation. Conducted strategic evaluations of team capabilities to allocate daily tasks which improved efficiency, reduced learning curves, and optimized resource allocation."
            },
            {
                "job_title": "Quantum Computing Curriculum Developer",
                "company": "Geering Up STEM Outreach UBC",
                "location": "Vancouver, BC",
                "start_date": "05/2023",
                "end_date": "08/2023",
                "responsibilities": "Collaborated with industry professionals and graduate students to develop age-appropriate curriculum materials for high school workshops, camps, and teacher training programs, created engaging and interactive learning experiences. Presented curriculum to instructors, provided training sessions, and guided them in the delivery of quantum computing workshops and camps. Collected and analyzed participant feedback to continuously improve curriculum content and instructional methods, aiming to enhance the educational experience."
            },
            {
                "job_title": "Network Systems Engineer",
                "company": "Infosys",
                "location": "Hyderabad, Telangana, India",
                "start_date": "07/2021",
                "end_date": "07/2022",
                "responsibilities": "Trained in Networking, Unix, Routing, Switching, Network Automation with Ansible and Agile and Scrum practices. Implemented design, documentation, and project management in EDGE DCs for Daimler, as a part of the Everest Project."
            }
        ],
        "skills": [
            "Python",
            "SQL/NoSQL",
            "Java",
            "C/C++",
            "Git",
            "Unix/Ansible",
            "HTML/CSS",
            "React",
            "Data Science/Machine Learning: Data Manipulation, Descriptive Statistics and Probability, Algorithms and Data Structures, Data Visualization, Statistical Inference, Supervised Learning, Regression, Computational Parsing, Computational Semantics, Unsupervised Learning, Computational Morphology, Machine Translation, Sentiment Analysis, NLP for Low Resource Languages, Prompt Engineering",
            "Electronics: Analog and Digital Networks, Switching and Logic Theory, Digital Signal and Image Processing"
        ],
        "volunteer_experience": [
            {
                "organization": "Stanford University",
                "role": "Section Leader for Code in Place",
                "location": "",
                "start_date": "",
                "end_date": "",
                "description": "Facilitated weekly discussion sessions for 8-10 students as a volunteer section leader to supplement professors' lectures in the 6-week introductory Python programming course. Collaborated with a diverse group of 700 volunteer teachers and 9000 students from around the world to deliver a quality educational experience."
            }
        ],
        "projects": [
            {
                "title": "NLP-Based Analysis of Ontario Housing Legislation and Judicial Relevance Factors in Decisions on Eviction (Capstone Project)",
                "description": "Conducted text mining and comprehensive analysis of 44,228 Ontario Housing cases using NLP principles. Developed a validated model to determine recurring factors that judges consider when ordering or delaying evictions. Designed and built an API/dashboard to provide quasi-real-time outcomes by applying the model to any Residential Tenancy Board (RTB) decisions.",
                "technologies": [],
                "link": ""
            },
            {
                "title": "SIGMORPHON Shared Task on Interlinear Glossing",
                "description": "Published a paper that was accepted into ACL titled “Glossy Bytes- Neural Glossing using Subword Encoding.” Researched ways to automate the creation of interlinear glossed text, a key annotated data type in linguistic fieldwork and often the sole form of annotated data accessible for NLP work in low-resource languages. Developed a transformer-based deep learning model that produces grammatical descriptions at the morpheme level based on input sentences adhering to the Leipzig glossing conventions.",
                "technologies": [],
                "link": ""
            },
            {
                "title": "Brainy: The Mental Health Screening Chatbot",
                "description": "Finetuned an LLM using cutting edge prompt engineering techniques to administer psychological screening surveys in a conversational manner. Developed a web app interface for the screening tests.",
                "technologies": [],
                "link": ""
            },
            {
                "title": "The Bookdel Test: Examining Female Participation in Jane Austen Novels",
                "description": "Adapted the Bechdel Test for classic literature using advanced corpus linguistics techniques using Jane Austen novels as a baseline. Annotated a collection of Jane Austen’s bibliography to assess gender representation. Developed a searchable web app for the entire annotated corpora. Featured on the UBC website's ‘Data Science in Action’ tab.",
                "technologies": [],
                "link": ""
            }
        ]
    },
    "years_exp": "5 years of experience in Natural Language Processing and Machine Learning",
    "profile": "Ananya Apparaju is a highly skilled professional with a robust background in natural language processing (NLP), machine learning, and deep learning. With a master’s degree in Data Science specializing in Computational Linguistics from the University of British Columbia and a bachelor’s degree in Electronics and Communications Engineering from Jawaharlal Nehru Technological University, Ananya combines technical expertise with a passion for solving complex problems. Her professional journey reflects a commitment to innovation in language technology, demonstrated through impactful roles at major organizations like Amazon and Meta.\n\nAt Amazon, Ananya serves as a Language Engineer, where she collaborates with scientists and engineers to design APIs, evaluate large language models (LLMs), and develop scalable solutions for language data production and analysis. Her work includes engineering prompts for generative AI, automating workflows, and managing customer-facing machine learning models. Previously, she led the Prompt Engineering team at Meta, where she developed novel human evaluation metrics for generative AI, enhancing model safety, accuracy, and engagement. Her ability to construct effective prompt-based fine-tuning strategies significantly improved AI capabilities while optimizing team efficiency and resource allocation.\n\nAnanya’s technical prowess extends beyond her professional roles to her research and project work. She co-authored a paper accepted by ACL on neural glossing for low-resource languages and conducted NLP-based analysis of Ontario housing legislation, building predictive models to assist judicial decisions. Her innovative projects, like the mental health chatbot “Brainy” and corpus analysis of Jane Austen novels, showcase her versatility in applying data science techniques across domains. Ananya is proficient in Python, Java, SQL/NoSQL, and tools like React and Unix/Ansible. Her dedication to education and community is evident through her volunteer work as a section leader for Stanford’s Code in Place program and her curriculum development in quantum computing for high school outreach. Ananya’s career reflects a blend of technical excellence, research innovation, and a commitment to driving meaningful impact in technology and society.",
    "res_dict": {
        "experience": {
            "cgi_experience": [
                {
                    "cgi_client_or_sector": "Major Financial Institution",
                    "cgi_position_title": "Software Developer",
                    "cgi_start_date": "05/2025",
                    "cgi_end_date": "Present",
                    "cgi_responsibilities": [
                        "Developed and optimized scalable backend services to support high-volume financial transaction processing systems.",
                        "Collaborated with cross-functional teams to gather requirements and deliver business-critical features on time and within scope.",
                        "Implemented robust application security measures to comply with industry standards and protect sensitive customer data.",
                        "Conducted code reviews and provided mentorship to junior developers, ensuring adherence to best practices and clean code principles."
                    ],
                    "cgi_technologies": [
                        "Java",
                        "Spring Boot",
                        "PostgreSQL",
                        "RESTful APIs",
                        "Docker",
                        "Kubernetes",
                        "GitLab CI/CD",
                        "Agile/Scrum Methodology"
                    ]
                }
            ],
            "other_experience": [
                {
                    "company": "Amazon",
                    "position_title": "Language Engineer I",
                    "start_date": "11/25",
                    "end_date": "Present",
                    "responsibilities": [
                        "Collaborated with scientists and engineers to design APIs, evaluate LLM performance, and develop scalable solutions for language data production and analysis.",
                        "Engineered prompts for generative AI, automated workflows, and performed data analysis using Python and scripting tools.",
                        "Managed customer-facing ML and deterministic models, resolved production issues, deployed Alexa language updates, and tested new features with modeling tools."
                    ],
                    "technologies": [
                        "Python"
                    ]
                },
                {
                    "company": "TEKsystems at Meta",
                    "position_title": "Machine Learning Engineer",
                    "start_date": "02/24",
                    "end_date": "09/24",
                    "responsibilities": [
                        "Performed extensive feature replacement for ads-based models to ensure privacy compliance while retaining neutral metrics.",
                        "Implemented innovative feature-replacement algorithms on models of varying architectures in a consolidated feature space.",
                        "Conducted thorough testing and analysis through offline experimentation and online A/B testing.",
                        "Collaborated closely with cross-functional teams to facilitate a seamless transition to privacy-compliant models."
                    ],
                    "technologies": []
                },
                {
                    "company": "TEKsystems at Meta",
                    "position_title": "Prompt Engineering Team Lead",
                    "start_date": "07/23",
                    "end_date": "02/24",
                    "responsibilities": [
                        "Led a comprehensive assessment of conversational abilities of generative AI models.",
                        "Established a novel human evaluation process to measure specific conversational criteria—developed metrics for safety, accuracy, naturalness, and engagement levels of AI responses.",
                        "Constructed effective prompt-based finetuning strategies, improved thorough adversarial and red-teaming experimentation.",
                        "Developed a backend Pythonic system to augment human evaluation.",
                        "Conducted strategic evaluations of team capabilities to allocate daily tasks which improved efficiency, reduced learning curves, and optimized resource allocation."
                    ],
                    "technologies": [
                        "Python"
                    ]
                },
                {
                    "company": "Geering Up STEM Outreach UBC",
                    "position_title": "Quantum Computing Curriculum Developer",
                    "start_date": "05/23",
                    "end_date": "08/23",
                    "responsibilities": [
                        "Collaborated with industry professionals and graduate students to develop age-appropriate curriculum materials for high school workshops, camps, and teacher training programs, created engaging and interactive learning experiences.",
                        "Presented curriculum to instructors, provided training sessions, and guided them in the delivery of quantum computing workshops and camps.",
                        "Collected and analyzed participant feedback to continuously improve curriculum content and instructional methods, aiming to enhance the educational experience."
                    ],
                    "technologies": []
                },
                {
                    "company": "Infosys",
                    "position_title": "Network Systems Engineer",
                    "start_date": "07/21",
                    "end_date": "07/22",
                    "responsibilities": [
                        "Trained in Networking, Unix, Routing, Switching, Network Automation with Ansible and Agile and Scrum practices.",
                        "Implemented design, documentation, and project management in EDGE DCs for Daimler, as a part of the Everest Project."
                    ],
                    "technologies": [
                        "Networking",
                        "Unix",
                        "Routing",
                        "Switching",
                        "Network Automation",
                        "Ansible"
                    ]
                }
            ]
        },
        "volunteer": {
            "volunteer_experience": [
                {
                    "role": "Section Leader",
                    "organization": "Code in Place, Stanford University",
                    "location": "Online",
                    "start_date": null,
                    "end_date": null,
                    "responsibilities": [
                        "Facilitated weekly discussion sessions for 8-10 students to supplement professors' lectures in a 6-week introductory Python programming course.",
                        "Collaborated with 700 volunteer teachers and 9000 students globally to deliver a quality educational experience."
                    ]
                }
            ]
        },
        "other_sections": {
            "industry_experience": [
                "Natural Language Processing",
                "Information Retrieval",
                "Machine Learning",
                "Deep Learning",
                "Electronics and Communications",
                "Networking",
                "Quantum Computing"
            ],
            "technical_specializations": [
                "Prompt Engineering",
                "Computational Parsing",
                "Machine Translation",
                "Sentiment Analysis",
                "NLP for Low Resource Languages",
                "Data Manipulation",
                "Statistical Inference",
                "Supervised Learning",
                "Unsupervised Learning",
                "Computational Morphology"
            ],
            "areas_of_expertise": [
                "Language Data Production and Analysis",
                "Generative AI",
                "Privacy-Compliant Models",
                "Conversational AI",
                "Quantum Computing Curriculum Development",
                "Network Automation"
            ],
            "languages": [
                "English"
            ],
            "environments": [
                "Unix",
                "Agile",
                "Scrum"
            ],
            "tools_and_software": [
                "Python",
                "SQL/NoSQL",
                "Java",
                "C/C++",
                "Git",
                "Unix/Ansible",
                "HTML/CSS",
                "React"
            ]
        },
        "skills_summary": {
            "technical_skills": [
                {
                    "skill": "Python",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "C++",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "Java",
                    "years_of_experience": 3,
                    "skill_level": 3
                },
                {
                    "skill": "Unix/Ansible",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "SQL/NoSQL",
                    "years_of_experience": 3,
                    "skill_level": 3
                }
            ],
            "application_knowledge": [
                {
                    "skill": "Data Manipulation",
                    "years_of_experience": 3,
                    "skill_level": 4
                },
                {
                    "skill": "Descriptive Statistics and Probability",
                    "years_of_experience": 3,
                    "skill_level": 3
                },
                {
                    "skill": "Machine Translation",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Sentiment Analysis",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Prompt Engineering",
                    "years_of_experience": 1,
                    "skill_level": 3
                }
            ],
            "it_disciplines": [
                {
                    "skill": "Networking",
                    "years_of_experience": 1,
                    "skill_level": 3
                },
                {
                    "skill": "Data Visualization",
                    "years_of_experience": 3,
                    "skill_level": 3
                },
                {
                    "skill": "Computational Parsing",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Algorithm Development",
                    "years_of_experience": 3,
                    "skill_level": 3
                },
                {
                    "skill": "Agile and Scrum Practices",
                    "years_of_experience": 1,
                    "skill_level": 2
                }
            ],
            "industry_knowledge": [
                {
                    "skill": "Natural Language Processing (NLP)",
                    "years_of_experience": 3,
                    "skill_level": 4
                },
                {
                    "skill": "Information Retrieval",
                    "years_of_experience": 3,
                    "skill_level": 3
                },
                {
                    "skill": "Electronics and Communications Engineering",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "Quantum Computing Education",
                    "years_of_experience": 1,
                    "skill_level": 2
                },
                {
                    "skill": "Ad-based Machine Learning Models",
                    "years_of_experience": 1,
                    "skill_level": 2
                }
            ],
            "other_relevant_skills": [
                {
                    "skill": "API Development",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "A/B Testing",
                    "years_of_experience": 1,
                    "skill_level": 3
                },
                {
                    "skill": "Feature Engineering",
                    "years_of_experience": 1,
                    "skill_level": 3
                },
                {
                    "skill": "Human Evaluation Process Design",
                    "years_of_experience": 1,
                    "skill_level": 3
                },
                {
                    "skill": "Curriculum Development",
                    "years_of_experience": 1,
                    "skill_level": 3
                }
            ]
        }
    },
    "job_description": "None provided"
}