{
    "structured_data": {
        "contact": {
            "name": "ANANYA APPARAJU",
            "email": "ananya.apparaju@gmail.com",
            "phone": "",
            "location": "",
            "linkedin": "",
            "website": ""
        },
        "professional_summary": "Passionate about solving complex problems in natural language processing and information retrieval. Skilled in machine learning and deep learning techniques. Experienced in Python, Java, and C++. Committed to continuous learning and driving innovation in language technology.",
        "education": [
            {
                "degree": "Master of Data Science",
                "field_of_study": "Computational Linguistics",
                "institution": "University of British Columbia",
                "location": "Vancouver, BC",
                "graduation_year": "2023"
            },
            {
                "degree": "Bachelor of Technology",
                "field_of_study": "Electronics and Communications Engineering",
                "institution": "Jawaharlal Nehru Technological University",
                "location": "Hyderabad, Telangana, India",
                "graduation_year": "2020"
            }
        ],
        "experience": [
            {
                "job_title": "Language Engineer I",
                "company": "Amazon",
                "location": "Chennai, India",
                "start_date": "11/25",
                "end_date": "Present",
                "responsibilities": "Collaborated with scientists and engineers to design APIs, evaluate LLM performance, and develop scalable solutions for language data production and analysis. Engineered prompts for generative AI, automated workflows, and performed data analysis using Python and scripting tools. Managed customer-facing ML and deterministic models, resolved production issues, deployed Alexa language updates, and tested new features with modeling tools."
            },
            {
                "job_title": "Machine Learning Engineer",
                "company": "TEKsystems at Meta",
                "location": "Vancouver, BC",
                "start_date": "02/2024",
                "end_date": "09/2024",
                "responsibilities": "Performed extensive feature replacement for ads-based models to ensure privacy compliance while retaining neutral metrics. Implemented innovative feature-replacement algorithms on models of varying architectures in a consolidated feature space. Conducted thorough testing and analysis through offline experimentation and online A/B testing. Collaborated closely with cross-functional teams to facilitate a seamless transition to privacy-compliant models."
            },
            {
                "job_title": "Prompt Engineering Team Lead",
                "company": "TEKsystems at Meta",
                "location": "Vancouver, BC",
                "start_date": "07/2023",
                "end_date": "02/2024",
                "responsibilities": "Led a comprehensive assessment of conversational abilities of generative AI models. Established a novel human evaluation process to measure specific conversational criteria- developed metrics for safety, accuracy, naturalness, and engagement levels of AI responses. Constructed effective prompt-based finetuning strategies, improved thorough adversarial and red-teaming experimentation. Developed a backend Pythonic system to augment human evaluation. Conducted strategic evaluations of team capabilities to allocate daily tasks which improved efficiency, reduced learning curves, and optimized resource allocation."
            },
            {
                "job_title": "Quantum Computing Curriculum Developer",
                "company": "Geering Up STEM Outreach UBC",
                "location": "Vancouver, BC",
                "start_date": "05/2023",
                "end_date": "08/2023",
                "responsibilities": "Collaborated with industry professionals and graduate students to develop age-appropriate curriculum materials for high school workshops, camps, and teacher training programs, created engaging and interactive learning experiences. Presented curriculum to instructors, provided training sessions, and guided them in the delivery of quantum computing workshops and camps. Collected and analyzed participant feedback to continuously improve curriculum content and instructional methods, aiming to enhance the educational experience."
            },
            {
                "job_title": "Network Systems Engineer",
                "company": "Infosys",
                "location": "Hyderabad, Telangana, India",
                "start_date": "07/2021",
                "end_date": "07/2022",
                "responsibilities": "Trained in Networking, Unix, Routing, Switching, Network Automation with Ansible and Agile and Scrum practices. Implemented design, documentation, and project management in EDGE DCs for Daimler, as a part of the Everest Project."
            }
        ],
        "skills": [
            "Python",
            "SQL/NoSQL",
            "Java",
            "C/C++",
            "Git",
            "Unix/Ansible",
            "HTML/CSS",
            "React",
            "Data Manipulation",
            "Descriptive Statistics and Probability",
            "Algorithms and Data Structures",
            "Data Visualization",
            "Statistical Inference",
            "Supervised Learning",
            "Regression",
            "Computational Parsing",
            "Computational Semantics",
            "Unsupervised Learning",
            "Computational Morphology",
            "Machine Translation",
            "Sentiment Analysis",
            "NLP for Low Resource Languages",
            "Prompt Engineering",
            "Analog and Digital Networks",
            "Switching and Logic Theory",
            "Digital Signal and Image Processing"
        ],
        "volunteer_experience": [
            {
                "organization": "Code in Place (Stanford University)",
                "role": "Section Leader",
                "location": "",
                "start_date": "",
                "end_date": "",
                "description": "Facilitated weekly discussion sessions for 8-10 students as a volunteer section leader to supplement professors' lectures in the 6-week introductory Python programming course. Collaborated with a diverse group of 700 volunteer teachers and 9000 students from around the world to deliver a quality educational experience."
            }
        ],
        "certifications": [],
        "projects": [
            {
                "title": "NLP-Based Analysis of Ontario Housing Legislation and Judicial Relevance Factors in Decisions on Eviction (Capstone Project)",
                "description": "Conducted text mining and comprehensive analysis of 44,228 Ontario Housing cases using NLP principles. Developed a validated model to determine recurring factors that judges consider when ordering or delaying evictions. Designed and built an API/dashboard to provide quasi-real-time outcomes by applying the model to any Residential Tenancy Board (RTB) decisions.",
                "technologies": [],
                "link": ""
            },
            {
                "title": "SIGMORPHON Shared Task on Interlinear Glossing",
                "description": "Published a paper that was accepted into ACL titled 'Glossy Bytes- Neural Glossing using Subword Encoding.' Researched ways to automate the creation of interlinear glossed text, a key annotated data type in linguistic fieldwork and often the sole form of annotated data accessible for NLP work in low-resource languages. Developed a transformer-based deep learning model that produces grammatical descriptions at the morpheme level based on input sentences adhering to the Leipzig glossing conventions.",
                "technologies": [],
                "link": ""
            },
            {
                "title": "Brainy: The Mental Health Screening Chatbot",
                "description": "Finetuned an LLM using cutting edge prompt engineering techniques to administer psychological screening surveys in a conversational manner. Developed a web app interface for the screening tests.",
                "technologies": [],
                "link": ""
            },
            {
                "title": "The Bookdel Test: Examining Female Participation in Jane Austen Novels",
                "description": "Adapted the Bechdel Test for classic literature using advanced corpus linguistics techniques using Jane Austen novels as a baseline. Annotated a collection of Jane Austen’s bibliography to assess gender representation. Developed a searchable web app for the entire annotated corpora. Featured on the UBC website's ‘Data Science in Action’ tab.",
                "technologies": [],
                "link": ""
            }
        ],
        "languages": [],
        "awards": []
    },
    "years_exp": "5 years of experience in Natural Language Processing and Machine Learning",
    "profile": "Ananya Apparaju is a dynamic professional with a strong foundation in natural language processing (NLP), machine learning, and deep learning techniques. With a Master of Data Science in Computational Linguistics from the University of British Columbia and a Bachelor of Technology in Electronics and Communications Engineering, she combines technical expertise with a passion for solving complex problems in information retrieval and language technology. Ananya has honed her skills in Python, Java, C++, and a myriad of other programming tools, showcasing her adaptability and commitment to continuous learning.\n\nIn her current role as a Language Engineer I at Amazon, Ananya collaborates with scientists and engineers to design APIs, evaluate large language model (LLM) performance, and develop scalable solutions for language data production. Previously, she served as a Machine Learning Engineer and Prompt Engineering Team Lead at Meta, where she led initiatives to ensure privacy compliance in ads-based models and spearheaded assessments of conversational AI capabilities. Her ability to manage cross-functional teams, create innovative prompt-based fine-tuning strategies, and optimize workflows has consistently delivered measurable impact in high-stakes environments.\n\nBeyond her professional roles, Ananya has contributed to academia and community initiatives. As a curriculum developer at Geering Up STEM Outreach UBC, she designed engaging quantum computing workshops for high school students. Her notable projects include publishing a paper on interlinear glossing for low-resource languages at ACL and developing an NLP-based dashboard to analyze Ontario housing legislation. Ananya’s dedication to advancing technology, coupled with her strong leadership and problem-solving skills, underscores her ability to drive innovation and create meaningful change in the field of computational linguistics.",
    "res_dict": {
        "experience": {
            "cgi_experience": [],
            "other_experience": [
                {
                    "company": "Amazon",
                    "position_title": "Language Engineer I",
                    "start_date": "11/25",
                    "end_date": "Present",
                    "responsibilities": [
                        "Designed APIs for language data production and analysis.",
                        "Evaluated large language model (LLM) performance.",
                        "Developed scalable solutions for language data workflows.",
                        "Created prompts for generative AI and automated workflows.",
                        "Conducted data analysis using Python and scripting tools.",
                        "Resolved production issues and deployed Alexa language updates.",
                        "Tested new features using machine learning and deterministic models."
                    ],
                    "technologies": [
                        "Python",
                        "Scripting Tools"
                    ]
                },
                {
                    "company": "TEKsystems at Meta",
                    "position_title": "Machine Learning Engineer",
                    "start_date": "02/24",
                    "end_date": "09/24",
                    "responsibilities": [
                        "Replaced features in ads-based models to ensure privacy compliance.",
                        "Implemented feature-replacement algorithms for various model architectures.",
                        "Conducted offline experimentation and online A/B testing for model analysis.",
                        "Collaborated with cross-functional teams to transition to privacy-compliant models."
                    ],
                    "technologies": [
                        "Python"
                    ]
                },
                {
                    "company": "TEKsystems at Meta",
                    "position_title": "Prompt Engineering Team Lead",
                    "start_date": "07/23",
                    "end_date": "02/24",
                    "responsibilities": [
                        "Assessed conversational abilities of generative AI models.",
                        "Developed a human evaluation process with safety, accuracy, and engagement metrics.",
                        "Constructed prompt-based fine-tuning strategies through experimentation.",
                        "Built a Python backend system to augment human evaluation workflows.",
                        "Optimized resource allocation by strategically assigning team tasks."
                    ],
                    "technologies": [
                        "Python"
                    ]
                },
                {
                    "company": "Geering Up STEM Outreach UBC",
                    "position_title": "Quantum Computing Curriculum Developer",
                    "start_date": "05/23",
                    "end_date": "08/23",
                    "responsibilities": [
                        "Developed curriculum materials for high school workshops and camps.",
                        "Presented curriculum to instructors and conducted training sessions.",
                        "Collected and analyzed participant feedback to improve content and methods."
                    ],
                    "technologies": []
                },
                {
                    "company": "Infosys",
                    "position_title": "Network Systems Engineer",
                    "start_date": "07/21",
                    "end_date": "07/22",
                    "responsibilities": [
                        "Trained in Networking, Unix, Routing, and Switching.",
                        "Applied network automation using Ansible and Agile/Scrum practices.",
                        "Designed, documented, and managed projects for EDGE data centers.",
                        "Collaborated on the Everest Project for Daimler."
                    ],
                    "technologies": [
                        "Networking",
                        "Unix",
                        "Ansible",
                        "Agile/Scrum"
                    ]
                }
            ]
        },
        "volunteer": {
            "volunteer_experience": [
                {
                    "role": "Section Leader",
                    "organization": "Code in Place, Stanford University",
                    "location": "",
                    "start_date": "",
                    "end_date": "",
                    "responsibilities": [
                        "Facilitated weekly discussion sessions for 8-10 students in a 6-week introductory Python programming course.",
                        "Collaborated with 700 volunteer teachers and 9000 students globally to deliver a quality educational experience."
                    ]
                }
            ]
        },
        "other_sections": {
            "industry_experience": [
                "Natural Language Processing (NLP)",
                "Machine Learning",
                "Deep Learning",
                "Quantum Computing Education",
                "Network Systems Engineering"
            ],
            "technical_specializations": [
                "Generative AI",
                "Prompt Engineering",
                "Computational Linguistics",
                "Feature Replacement Algorithms",
                "Transformer-based Deep Learning Models",
                "Data Manipulation",
                "NLP for Low Resource Languages"
            ],
            "areas_of_expertise": [
                "Data Science",
                "Statistical Inference",
                "Supervised and Unsupervised Learning",
                "Machine Translation",
                "Sentiment Analysis",
                "Computational Parsing",
                "Computational Semantics",
                "Analog and Digital Networks",
                "Digital Signal and Image Processing"
            ],
            "languages": [
                "English"
            ],
            "environments": [
                "Networking Systems",
                "Unix",
                "Agile and Scrum Practices",
                "EDGE Data Centers"
            ],
            "tools_and_software": [
                "Python",
                "SQL/NoSQL",
                "Java",
                "C/C++",
                "Git",
                "Unix/Ansible",
                "HTML/CSS",
                "React"
            ]
        },
        "skills_summary": {
            "technical_skills": [
                {
                    "skill": "Python",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "Java",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "C++",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "SQL/NoSQL",
                    "years_of_experience": 3,
                    "skill_level": 3
                },
                {
                    "skill": "Unix/Ansible",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "React",
                    "years_of_experience": 2,
                    "skill_level": 2
                }
            ],
            "application_knowledge": [
                {
                    "skill": "Data Visualization",
                    "years_of_experience": 3,
                    "skill_level": 3
                },
                {
                    "skill": "Statistical Inference",
                    "years_of_experience": 3,
                    "skill_level": 3
                },
                {
                    "skill": "Regression Analysis",
                    "years_of_experience": 3,
                    "skill_level": 3
                },
                {
                    "skill": "Supervised Learning",
                    "years_of_experience": 3,
                    "skill_level": 3
                },
                {
                    "skill": "Unsupervised Learning",
                    "years_of_experience": 3,
                    "skill_level": 3
                }
            ],
            "it_disciplines": [
                {
                    "skill": "Machine Learning",
                    "years_of_experience": 3,
                    "skill_level": 4
                },
                {
                    "skill": "Natural Language Processing (NLP)",
                    "years_of_experience": 3,
                    "skill_level": 4
                },
                {
                    "skill": "Prompt Engineering",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Network Automation",
                    "years_of_experience": 1,
                    "skill_level": 3
                },
                {
                    "skill": "Routing and Switching",
                    "years_of_experience": 1,
                    "skill_level": 2
                }
            ],
            "industry_knowledge": [
                {
                    "skill": "Quantum Computing",
                    "years_of_experience": 1,
                    "skill_level": 2
                },
                {
                    "skill": "Electronics and Communications Engineering",
                    "years_of_experience": 4,
                    "skill_level": 4
                },
                {
                    "skill": "Generative AI",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Ad Tech",
                    "years_of_experience": 1,
                    "skill_level": 2
                }
            ],
            "other_relevant_skills": [
                {
                    "skill": "Agile and Scrum Practices",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Educational Curriculum Development",
                    "years_of_experience": 1,
                    "skill_level": 3
                },
                {
                    "skill": "Technical Documentation",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "API Development",
                    "years_of_experience": 2,
                    "skill_level": 3
                },
                {
                    "skill": "Data Parsing",
                    "years_of_experience": 3,
                    "skill_level": 3
                }
            ]
        }
    },
    "job_description": "None provided"
}