{
  "cgi_experience": [],
  "other_experience": [
    {
      "company": "Nova Scotia Community College",
      "position_title": "Head of Offensive Security Club",
      "start_date": "08/24",
      "end_date": "Present",
      "responsibilities": [
        "Designed Capture The Flag challenges and labs using Virtual Machines to enhance students' offensive security skills effectively."
      ],
      "technologies": []
    },
    {
      "company": "Maritime Warfare Center",
      "position_title": "Senior Staff Officer – Simulation and Modelling",
      "start_date": "07/22",
      "end_date": "08/23",
      "responsibilities": [
        "Directed simulation and modelling efforts to support Royal Canadian Navy operations and training initiatives.",
        "Spearheaded a $40 million classified network upgrade project, contributing to the modernization of naval capabilities."
      ],
      "technologies": []
    },
    {
      "company": "Naval Fleet School (Atlantic)",
      "position_title": "Combat Systems Engineering Division Commander",
      "start_date": "07/19",
      "end_date": "07/22",
      "responsibilities": [
        "Managed the training programs for Weapons Engineering Technicians and Combat Systems Engineering Officers in the East Coast fleet.",
        "Supervised and mentored a team of 40 staff to achieve successful throughput of 120 students annually."
      ],
      "technologies": []
    },
    {
      "company": "Fleet Maintenance Facility Cape Scott",
      "position_title": "Executive Officer",
      "start_date": "10/16",
      "end_date": "07/19",
      "responsibilities": [
        "Oversaw HR, IT, and security operations for a 1,000-person unit specializing in ship repair and maintenance.",
        "Led a team of 7 to successfully mitigate operational risks and ensure smooth ship maintenance activities."
      ],
      "technologies": []
    },
    {
      "company": "Naval Fleet School (Atlantic)",
      "position_title": "Campus Support Division Commander",
      "start_date": "01/14",
      "end_date": "10/16",
      "responsibilities": [
        "Supervised security, IT, and equipment maintenance to ensure uninterrupted training for approximately 600 students annually.",
        "Managed 8 section heads and 60 personnel, implementing strategies to minimize training disruptions effectively."
      ],
      "technologies": []
    },
    {
      "company": "HMCS Ville de Quebec",
      "position_title": "Combat Systems Engineering Officer",
      "start_date": "07/12",
      "end_date": "01/14",
      "responsibilities": [
        "Ensured mission readiness of all combat systems aboard HMCS Ville de Quebec while minimizing equipment downtime.",
        "Directed a 60-person department, enabling a successful counter-drug operation in the Caribbean Basin."
      ],
      "technologies": []
    },
    {
      "company": "Maritime Equipment Program Management",
      "position_title": "Staff Officer (Minor Warships and Auxiliary Vessels)",
      "start_date": "07/10",
      "end_date": "07/12",
      "responsibilities": [
        "Led multi-million dollar upgrade projects, including satellite communication enhancements for KINGSTON class vessels.",
        "Coordinated maintenance and equipment upgrade efforts for Minor War Vessels in the Royal Canadian Navy."
      ],
      "technologies": []
    },
    {
      "company": "Royal Canadian Navy",
      "position_title": "Engineering Officer under training",
      "start_date": "08/04",
      "end_date": "07/10",
      "responsibilities": [
        "Completed training as Head of Combat Systems Engineering for HALIFAX class Frigates, specializing in critical systems.",
        "Certified in safety roles including Radiation Safety Officer and Ammunition Officer, accumulating 300 sea days in deployments."
      ],
      "technologies": []
    }
  ]
}