{
  "cgi_experience": [
    {
      "cgi_client_or_sector": "Information Technology",
      "cgi_position_title": "Business Analyst & Project Coordinator",
      "cgi_start_date": "07/24",
      "cgi_end_date": "Present",
      "cgi_responsibilities": [
        "Documented current state business processes to identify operational efficiency opportunities.",
        "Derived actionable insights using advanced analytical skills to enhance data-driven decision-making.",
        "Drafted future-state recommendations including streamlined processes, customer journey maps, organizational design, and operational improvements.",
        "Produced comprehensive reports using Excel and PowerPoint to improve stakeholder communication.",
        "Created future state blueprints and implementation plans including organizational structure, roles, effort, and cost.",
        "Coordinated tasks, schedules, and resources to ensure project success within defined scopes."
      ],
      "cgi_technologies": [
        "Excel",
        "PowerPoint"
      ]
    }
  ],
  "other_experience": [
    {
      "company": "Canadian Tire",
      "position_title": "Cash Balancer",
      "start_date": "11/23",
      "end_date": "07/24",
      "responsibilities": [
        "Verified accuracy in financial documents to ensure consistent cash flow information.",
        "Analyzed financial documents using knowledge from finance courses.",
        "Managed allocation of funds paid to the establishment for bank deposit preparation."
      ]
    },
    {
      "company": "Government of Nova Scotia",
      "position_title": "Operational & Service Excellence Intern",
      "start_date": "01/23",
      "end_date": "08/23",
      "responsibilities": [
        "Designed and delivered virtual programs, services, and training for over 230 participants using MS Teams, Power Automate, Excel, and Outlook.",
        "Facilitated team meetings to identify organizational barriers and propose solutions.",
        "Developed standard operating procedures for services and events to ensure uniform operations.",
        "Managed business process improvement training programs, including Lean Six Sigma certifications.",
        "Created data visualization dashboards using Power BI to enhance data analysis.",
        "Supported Lean Six Sigma Yellow Belt certification initiatives across the government.",
        "Organized and coordinated a major event with over 70 participants.",
        "Implemented the 5S methodology to develop an organizational system that improved team efficiency."
      ]
    },
    {
      "company": "Canadian Tire",
      "position_title": "Customer Service Representative",
      "start_date": "11/15",
      "end_date": "06/22",
      "responsibilities": [
        "Resolved customer inquiries and complaints using effective communication and organizational skills.",
        "Provided customer service tailored to diverse needs in a fast-paced environment.",
        "Handled cash transactions and prepared registers for store opening.",
        "Trained incoming employees on store policies, processes, and technologies.",
        "Managed staffing allocation and break schedules for up to 8 cashiers per shift.",
        "Enhanced problem-solving and communication skills while collaborating across various departments."
      ]
    }
  ]
}