{
  "cgi_experience": [],
  "other_experience": [
    {
      "company": "Amazon",
      "position_title": "Language Engineer I",
      "start_date": "11/25",
      "end_date": "Present",
      "responsibilities": [
        "Collaborated with scientists and engineers to design APIs, evaluate LLM performance, and develop scalable solutions for language data production and analysis.",
        "Engineered prompts for generative AI, automated workflows, and performed data analysis using Python and scripting tools.",
        "Managed customer-facing ML and deterministic models, resolved production issues, deployed Alexa language updates, and tested new features with modeling tools."
      ],
      "technologies": [
        "Python"
      ]
    },
    {
      "company": "TEKsystems at Meta",
      "position_title": "Machine Learning Engineer",
      "start_date": "02/24",
      "end_date": "09/24",
      "responsibilities": [
        "Performed extensive feature replacement for ads-based models to ensure privacy compliance while retaining neutral metrics.",
        "Implemented innovative feature-replacement algorithms on models of varying architectures in a consolidated feature space.",
        "Conducted thorough testing and analysis through offline experimentation and online A/B testing.",
        "Collaborated closely with cross-functional teams to facilitate a seamless transition to privacy-compliant models."
      ],
      "technologies": []
    },
    {
      "company": "TEKsystems at Meta",
      "position_title": "Prompt Engineering Team Lead",
      "start_date": "07/23",
      "end_date": "02/24",
      "responsibilities": [
        "Led a comprehensive assessment of conversational abilities of generative AI models.",
        "Established a novel human evaluation process to measure specific conversational criteria—developed metrics for safety, accuracy, naturalness, and engagement levels of AI responses.",
        "Constructed effective prompt-based finetuning strategies, improved thorough adversarial and red-teaming experimentation.",
        "Developed a backend Pythonic system to augment human evaluation.",
        "Conducted strategic evaluations of team capabilities to allocate daily tasks which improved efficiency, reduced learning curves, and optimized resource allocation."
      ],
      "technologies": [
        "Python"
      ]
    },
    {
      "company": "Geering Up STEM Outreach UBC",
      "position_title": "Quantum Computing Curriculum Developer",
      "start_date": "05/23",
      "end_date": "08/23",
      "responsibilities": [
        "Collaborated with industry professionals and graduate students to develop age-appropriate curriculum materials for high school workshops, camps, and teacher training programs, created engaging and interactive learning experiences.",
        "Presented curriculum to instructors, provided training sessions, and guided them in the delivery of quantum computing workshops and camps.",
        "Collected and analyzed participant feedback to continuously improve curriculum content and instructional methods, aiming to enhance the educational experience."
      ],
      "technologies": []
    },
    {
      "company": "Infosys",
      "position_title": "Network Systems Engineer",
      "start_date": "07/21",
      "end_date": "07/22",
      "responsibilities": [
        "Trained in Networking, Unix, Routing, Switching, Network Automation with Ansible and Agile and Scrum practices.",
        "Implemented design, documentation, and project management in EDGE DCs for Daimler, as a part of the Everest Project."
      ],
      "technologies": [
        "Networking",
        "Unix",
        "Routing",
        "Switching",
        "Network Automation",
        "Ansible"
      ]
    }
  ]
}