{
  "cgi_experience": [
    {
      "cgi_client_or_sector": "Large Canadian Bank & Insurance Company",
      "cgi_position_title": "Senior Big Data Analytics Engineer",
      "cgi_start_date": "01/21",
      "cgi_end_date": "Present",
      "cgi_responsibilities": [
        "Developed Tableau dashboards for executives, managers, and analysts to track key insurance claim metrics.",
        "Created and optimized the data layer for reporting.",
        "Automated script conversion from HQL to Spark using Azure Databricks and ensured production readiness through data comparisons.",
        "Migrated over 500 scripts to production.",
        "Transitioned 30+ Tableau reports to align with new pipeline structures in the HPE Phase 2 project.",
        "Implemented Python utilities to extract metadata from Tableau files for process improvements.",
        "Optimized Tableau licensing and maintained centralized metadata repositories."
      ],
      "cgi_technologies": [
        "Tableau",
        "Azure Databricks",
        "Python",
        "HQL",
        "Spark"
      ]
    }
  ],
  "other_experience": [
    {
      "company": "Tata Consultancy Services Limited",
      "position_title": "Lead Data Analyst & Data Engineer",
      "start_date": "12/12",
      "end_date": "12/20",
      "responsibilities": [
        "Collaborated with stakeholders to address analytical challenges and documented data lineage for solutions.",
        "Designed interactive Tableau dashboards for Finance, reducing cash collection time by 80% and maximizing revenue.",
        "Integrated Adobe Analytics and Salesforce data into the warehouse for actionable insights.",
        "Performed exploratory data analysis using Python and prepared data for machine learning models.",
        "Created a Spotfire-based Decommission Dashboard, reducing presentation efforts by 95%.",
        "Designed star schemas and RPDs for OBIEE based on customer requirements.",
        "Built data pipelines, transformations, and reporting infrastructures using Informatica, Talend, AWS Aurora, S3, Athena, Tableau, and Spotfire.",
        "Integrated heterogeneous data sources into the enterprise data warehouse and applied data quality rules."
      ],
      "technologies": [
        "Tableau",
        "Spotfire",
        "Python",
        "OBIEE",
        "Informatica",
        "Talend",
        "AWS Aurora",
        "S3",
        "Athena"
      ]
    },
    {
      "company": "Infosys Limited",
      "position_title": "Technology Analyst",
      "start_date": "04/11",
      "end_date": "12/12",
      "responsibilities": [
        "Met data ingestion and reporting requirements for a talent management platform.",
        "Implemented OBIA HR analytics with OBIEE 11g, Informatica, DAC, and Oracle Database.",
        "Extracted PeopleSoft transactional data into OBIEE's Oracle data warehouse using Informatica.",
        "Developed strategic scorecards tailored to product requirements."
      ],
      "technologies": [
        "OBIEE",
        "Informatica",
        "Oracle Database"
      ]
    }
  ]
}