{
  "cgi_experience": [
    {
      "cgi_client_or_sector": "IT Services",
      "cgi_position_title": "Business Analyst & Project Coordinator",
      "cgi_start_date": "07/24",
      "cgi_end_date": "Present",
      "cgi_responsibilities": [
        "Documented current state business processes to identify opportunities for operational efficiency.",
        "Performed advanced data analysis to provide actionable insights for project assessments.",
        "Drafted recommendations for future-state processes, including customer journey mapping and operational improvements.",
        "Prepared detailed reports using Excel and PowerPoint to enhance communication with stakeholders.",
        "Developed blueprints and implementation plans outlining organizational structure, roles, efforts, and cost.",
        "Managed project coordination tasks, schedules, and resources to ensure adherence to scopes."
      ],
      "cgi_technologies": [
        "Excel",
        "PowerPoint",
        "Tableau",
        "SAP"
      ]
    }
  ],
  "other_experience": [
    {
      "company": "Canadian Tire",
      "position_title": "Cash Balancer",
      "start_date": "11/23",
      "end_date": "07/24",
      "responsibilities": [
        "Validated financial documents to ensure accurate cash flow information.",
        "Analyzed financial data using knowledge of finance and financial statements.",
        "Prepared bank deposits by allocating funds received at the establishment."
      ]
    },
    {
      "company": "Government of Nova Scotia",
      "position_title": "Operational & Service Excellence Intern",
      "start_date": "01/23",
      "end_date": "08/23",
      "responsibilities": [
        "Designed and delivered virtual programs, services, and training for over 230 participants.",
        "Facilitated team meetings to identify and address organizational barriers.",
        "Developed standard operating procedures to ensure consistency in services and events.",
        "Led business process improvement initiatives, including Lean Six Sigma training programs.",
        "Created dashboards using Power BI for enhanced data visualization and analytics.",
        "Supported Lean Six Sigma Yellow Belt Certification by completing Quick Win projects.",
        "Organized and coordinated a major event for over 70 attendees.",
        "Improved team efficiency by implementing a 5S organizational system."
      ]
    },
    {
      "company": "Canadian Tire",
      "position_title": "Customer Service Representative",
      "start_date": "11/15",
      "end_date": "06/22",
      "responsibilities": [
        "Resolved customer inquiries and complaints, enhancing communication and conflict resolution skills.",
        "Delivered outstanding customer service in a high-pressure environment.",
        "Managed cash transactions and prepared registers for store openings.",
        "Trained new employees on store policies, procedures, and technology use.",
        "Scheduled staffing and break times for up to 8 cashiers per shift.",
        "Developed problem-solving, organizational, and communication skills across multiple departments."
      ]
    }
  ]
}