{
  "cgi_experience": [],
  "other_experience": [
    {
      "company": "Self-employed",
      "position_title": "Independent Data Scientist",
      "start_date": "12/24",
      "end_date": "Present",
      "responsibilities": [
        "Developed an application to make scanned Iranian historical archives searchable using Retrieval-Augmented Generation (RAG).",
        "Converted scanned newspaper archives into machine-readable text, improving accessibility for researchers and historians.",
        "Implemented full-text and semantic search to enable intuitive and efficient document retrieval.",
        "Created a graph-based search tool for exploring document relationships via graph visualizations.",
        "Built a chatbot interface for natural language queries to simplify archive exploration."
      ],
      "technologies": [
        "Python",
        "R",
        "SQL",
        "PostgreSQL",
        "Pgvector",
        "Elasticsearch",
        "LangChain",
        "Llamaindex",
        "Streamlit"
      ]
    },
    {
      "company": "Nu Data",
      "position_title": "Data Scientist",
      "start_date": "04/24",
      "end_date": "11/24",
      "responsibilities": [
        "Developed a custom Agentic RAG solution offering vetted data, analytics, and visualizations through a chatbot interface.",
        "Fine-tuned Large Language Models to improve semantic search, question answering, and function calling capabilities.",
        "Built automated web scraping tools to collect large-scale data from over 50 sources."
      ],
      "technologies": [
        "Python",
        "Pytorch",
        "Large Language Models",
        "LangChain",
        "Flask",
        "Streamlit",
        "AWS (EC2, ECS, S3)",
        "Docker"
      ]
    },
    {
      "company": "XYON Health",
      "position_title": "Data Scientist",
      "start_date": "09/23",
      "end_date": "03/24",
      "responsibilities": [
        "Designed and built a data warehouse, reducing reporting time by 70% for business operations.",
        "Created scalable ETL pipelines to integrate data from more than 11 sources efficiently.",
        "Developed connected dashboards delivering actionable insights for marketing, finance, and operations teams."
      ],
      "technologies": [
        "Python",
        "SQL",
        "PostgreSQL",
        "AWS Redshift",
        "Power BI",
        "Prefect",
        "Docker"
      ]
    },
    {
      "company": "BC Stats - Capstone Project",
      "position_title": "Data Scientist",
      "start_date": "05/23",
      "end_date": "07/23",
      "responsibilities": [
        "Developed a semantic search system improving BC Data Catalogue's search precision by 25% and recall by 40%.",
        "Created a topic modeling solution with interactive visualizations, enhancing the user experience for BC Data Catalogue.",
        "Received two awards for project presentation and was featured on the UBC website for excellence."
      ],
      "technologies": [
        "Python",
        "scikit-learn",
        "LangChain",
        "Matplotlib",
        "Plotly"
      ]
    },
    {
      "company": "BoldZee",
      "position_title": "Data Analyst",
      "start_date": "02/19",
      "end_date": "09/21",
      "responsibilities": [
        "Automated data scraping pipelines to extract structured and unstructured data from over 40 sources.",
        "Developed and optimized ETL pipelines, improving data processing efficiency by 20% through streamlined workflows."
      ],
      "technologies": [
        "Python",
        "SQL",
        "PostgreSQL",
        "MongoDB",
        "Airflow",
        "Docker"
      ]
    }
  ]
}