{
  "cgi_experience": [
    {
      "cgi_client_or_sector": "Information Technology",
      "cgi_position_title": "Business Analyst & Project Coordinator",
      "cgi_start_date": "07/24",
      "cgi_end_date": "Present",
      "cgi_responsibilities": [
        "Documented current-state business processes to identify operational efficiency opportunities.",
        "Performed advanced analyses to derive actionable insights for project evaluation.",
        "Drafted streamlined processes, customer journey maps, organizational designs, and operational enhancements.",
        "Produced detailed reports using Excel and PowerPoint to improve stakeholder communication.",
        "Designed future-state blueprints, including organizational structure, roles, and cost analysis.",
        "Coordinated tasks, schedules, and resources to ensure project success within scope."
      ],
      "cgi_technologies": [
        "Excel",
        "PowerPoint"
      ]
    }
  ],
  "other_experience": [
    {
      "company": "Canadian Tire",
      "position_title": "Cash Balancer",
      "start_date": "11/23",
      "end_date": "07/24",
      "responsibilities": [
        "Reviewed financial documents to ensure accurate cash flow.",
        "Interpreted financial records using finance and accounting knowledge.",
        "Allocated funds and organized bank deposits for the establishment."
      ]
    },
    {
      "company": "Government of Nova Scotia",
      "position_title": "Operational & Service Excellence Intern",
      "start_date": "01/23",
      "end_date": "08/23",
      "responsibilities": [
        "Created virtual programs and trainings for over 230 participants across the Provincial Government.",
        "Facilitated team meetings to identify and address organizational barriers.",
        "Developed standard operating procedures for consistent service operations.",
        "Oversaw Lean Six Sigma training programs, enhancing process improvement knowledge.",
        "Built Power BI dashboards for improved data analytics and insights.",
        "Supported government employees in achieving Lean Six Sigma Yellow Belt Certification.",
        "Planned and coordinated a major event with over 70 attendees.",
        "Implemented 5S methodology to enhance team efficiency."
      ]
    },
    {
      "company": "Canadian Tire",
      "position_title": "Customer Service Representative",
      "start_date": "11/15",
      "end_date": "06/22",
      "responsibilities": [
        "Resolved customer inquiries and complaints, showcasing strong communication and conflict resolution skills.",
        "Provided exceptional customer service in a fast-paced environment.",
        "Managed cash handling and prepared registers for store opening.",
        "Trained new employees on store policies, processes, and technology.",
        "Scheduled staffing and managed time for up to 8 cashiers per shift.",
        "Applied problem-solving, organizational, and communication skills across departments."
      ]
    }
  ]
}