{
  "cgi_experience": [
    {
      "cgi_client_or_sector": "Consulting",
      "cgi_position_title": "Business Analyst & Project Coordinator",
      "cgi_start_date": "07/24",
      "cgi_end_date": "Present",
      "cgi_responsibilities": [
        "Documented current state business processes to identify and define opportunities for operational efficiency.",
        "Applied advanced analytical skills to extract actionable insights, enhancing accuracy in data-driven decision-making for project analysis.",
        "Drafted recommendations for future-state improvements, including streamlined processes, customer journey maps, organizational design, and operational enhancements.",
        "Created comprehensive reports using Excel and PowerPoint to improve stakeholder communication and facilitate decision-making.",
        "Designed future state blueprints and implementation plans, including organizational structures, roles, efforts, and cost estimates.",
        "Managed tasks, schedules, and resources to ensure successful project delivery within defined scopes."
      ],
      "cgi_technologies": [
        "Excel",
        "PowerPoint"
      ]
    }
  ],
  "other_experience": [
    {
      "company": "Canadian Tire",
      "position_title": "Cash Balancer",
      "start_date": "11/23",
      "end_date": "07/24",
      "responsibilities": [
        "Ensured accuracy in financial documents to obtain precise cash flow information.",
        "Analyzed and interpreted financial statements using knowledge gained from finance courses.",
        "Allocated funds to develop accurate bank deposits."
      ]
    },
    {
      "company": "Government of Nova Scotia",
      "position_title": "Operational & Service Excellence Intern",
      "start_date": "01/23",
      "end_date": "08/23",
      "responsibilities": [
        "Designed and implemented virtual programs, services, and trainings for over 230 participants within the Provincial Government.",
        "Facilitated team meetings using periodic management techniques to identify and address organizational barriers.",
        "Created standardized operating procedures for services and events to ensure consistent operations.",
        "Managed business improvement trainings, including Lean Six Sigma certifications.",
        "Developed visual dashboards using Power BI to enhance data analytics.",
        "Supported government employees in achieving Lean Six Sigma Yellow Belt certification.",
        "Collaborated with colleagues to plan and execute a major event for over 70 attendees.",
        "Implemented an organizational system using 5S methodology to enhance team efficiency."
      ],
      "technologies": [
        "MS Teams",
        "Power Automate",
        "Excel",
        "Outlook",
        "Power BI"
      ]
    },
    {
      "company": "Canadian Tire",
      "position_title": "Customer Service Representative",
      "start_date": "11/15",
      "end_date": "06/22",
      "responsibilities": [
        "Provided exceptional customer service, resolving diverse inquiries and complaints in a fast-paced environment.",
        "Handled cash transactions responsibly and prepared registers for store opening.",
        "Trained new employees on store policies, processes, and technology.",
        "Organized staffing schedules, managing break times for up to eight cashiers per shift.",
        "Enhanced problem-solving, organizational, and communication skills while working in various departments."
      ]
    }
  ]
}