{
  "cgi_experience": [],
  "other_experience": [
    {
      "company": "Nova Scotia Community College",
      "position_title": "Head of Offensive Security Club",
      "start_date": "08/24",
      "end_date": "Present",
      "responsibilities": [
        "Developed Capture the Flag (CTF) challenges and labs utilizing Virtual Machines to enhance learning experiences.",
        "Guided Cyber Security students in improving their knowledge and skills in Offensive Security techniques."
      ],
      "technologies": []
    },
    {
      "company": "Maritime Warfare Center",
      "position_title": "Senior Staff Officer – Simulation and Modelling",
      "start_date": "07/22",
      "end_date": "08/23",
      "responsibilities": [
        "Directed a $40 million classified network upgrade project with a focus on security and modernization.",
        "Played a critical role in updating the Royal Canadian Navy's infrastructure to align with modern standards."
      ],
      "technologies": []
    },
    {
      "company": "Naval Fleet School (Atlantic)",
      "position_title": "Combat Systems Engineering Division Commander",
      "start_date": "07/19",
      "end_date": "07/22",
      "responsibilities": [
        "Managed training programs for Weapons Engineering Technicians and Combat Systems Engineering Officers.",
        "Supervised and mentored a team of 40 staff members, ensuring the successful training of 120 students annually."
      ],
      "technologies": []
    },
    {
      "company": "Fleet Maintenance Facility Cape Scott",
      "position_title": "Executive Officer",
      "start_date": "10/16",
      "end_date": "07/19",
      "responsibilities": [
        "Oversaw HR, IT, and security operations for a 1000-person unit specializing in ship repair and maintenance.",
        "Led a 7-member team to efficiently manage operational risks and ensure smooth ship maintenance processes."
      ],
      "technologies": []
    },
    {
      "company": "Naval Fleet School (Atlantic)",
      "position_title": "Campus Support Division Commander",
      "start_date": "01/14",
      "end_date": "10/16",
      "responsibilities": [
        "Directed security, IT, scheduling, purchasing, safety, and equipment maintenance for the school.",
        "Supervised 8 section heads and managed 60 staff members to ensure uninterrupted training for 600 students annually.",
        "Mitigated risks to prevent training disruptions and minimize operational downtime."
      ],
      "technologies": []
    },
    {
      "company": "HMCS Ville de Quebec",
      "position_title": "Combat Systems Engineering Officer",
      "start_date": "07/12",
      "end_date": "01/14",
      "responsibilities": [
        "Ensured operational readiness of all Combat Systems aboard the ship to support mission success.",
        "Managed a team of 60 technicians to minimize equipment downtime and maintain system functionality.",
        "Contributed to a successful counter-drug operation in the Caribbean Basin through effective system management."
      ],
      "technologies": []
    },
    {
      "company": "Maritime Equipment Program Management",
      "position_title": "Staff Officer (Minor Warships and Auxiliary Vessels)",
      "start_date": "07/10",
      "end_date": "07/12",
      "responsibilities": [
        "Led equipment upgrade projects and maintenance for Minor War Vessels within the Royal Canadian Navy.",
        "Executed multi-million dollar projects, including a satellite communication upgrade for Maritime Coastal Defense Vessels."
      ],
      "technologies": []
    },
    {
      "company": "Royal Canadian Navy",
      "position_title": "Engineering Officer under training",
      "start_date": "08/04",
      "end_date": "07/10",
      "responsibilities": [
        "Completed training to lead the Combat Systems Engineering Department aboard HALIFAX class Frigates.",
        "Served in specialized roles including Radiation Safety Officer and Ammunition Officer to ensure safety compliance.",
        "Accumulated 300 sea days, deploying to critical operations in the Gulf of Aden and Arctic Ocean."
      ],
      "technologies": []
    }
  ]
}